[
    {
        "content": "<p>Whenever I use <a href=\"https://github.com/search?q=Plots.jl&amp;type=Repositories\">Plots.jl</a> with the GR backend, for each <code>savefig</code> or <code>frame</code> (used for animations) call I get a popup window in the focused workspace.</p>\n<p>For one or two plots, this is fine. However, when doing a lot of plots or animations, my computer becomes almost unusable while Julia is plotting. Is there a workaround for this besides using another backend?</p>",
        "id": 246615863,
        "sender_full_name": "pg.",
        "timestamp": 1626798692
    },
    {
        "content": "<p>I havn't encountered this problem myself, but if you share additional information, maybe someone can find an answer.</p>\n<p>What OS are you using? Windows, Linux or Mac?<br>\nAnd what is written on popups? Is it some kind of error message?</p>",
        "id": 246618971,
        "sender_full_name": "Kwaku Oskin",
        "timestamp": 1626800231
    },
    {
        "content": "<p>This is on Linux, but I remember it occuring on windows also. Nope no error message, just a window pops up and then disappears quickly. It is so fast that I cannot tell what is on it. It is as if GR opens a window whenever it renders.</p>",
        "id": 246624903,
        "sender_full_name": "pg.",
        "timestamp": 1626802883
    },
    {
        "content": "<p>does a semi-colon <code>;</code> at the end of the line remove the pop-up?</p>",
        "id": 246800873,
        "sender_full_name": "Patrick Toche",
        "timestamp": 1626918190
    },
    {
        "content": "<p>So it actually stopped happening.. and I have no idea why. It's been bothering me for months, only made a post now because I am working on a <br>\n project that needs a lot of animations, and somehow, a day afterwards it's solved. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 246851752,
        "sender_full_name": "pg.",
        "timestamp": 1626962938
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"297015\">peter j.</span> has marked this topic as resolved.</p>",
        "id": 246851981,
        "sender_full_name": "Notification Bot",
        "timestamp": 1626963028
    }
]