[
    {
        "content": "<p>What are good options for Cloud Computing with Julia? I'm mostly interested in Machine Learning. I found Julia Hub, but there is no free tier, so I was looking for alternatives. It would be good to know what the community is recommending. :D</p>",
        "id": 224373385,
        "sender_full_name": "Davi Sales Barreira",
        "timestamp": 1611859567
    },
    {
        "content": "<p>Depends on what you are looking to do.  I personally prefer just running stuff on ordinary linux servers.  Distributed computing with Julia supports <a href=\"https://github.com/JuliaParallel/ClusterManagers.jl\">ClusterMangers</a> so it's fairly straightforward to just launch a bunch of servers and run distributed jobs</p>",
        "id": 224373695,
        "sender_full_name": "Expanding Man",
        "timestamp": 1611859683
    },
    {
        "content": "<p>If your question was about hosting, then you can look for hosting wherever you'd look for hosting for anywhere else.  In general there aren't too many people eager to host free servers for people, so it seems likely you'd have to pay in any case</p>",
        "id": 224373867,
        "sender_full_name": "Expanding Man",
        "timestamp": 1611859749
    },
    {
        "content": "<p>Thanks. I'm mostly interested in ML, so JuliaHub is the sort of stuff I'm looking for. Sometimes they offer a free tier, like Google Collab (which I don't really like), so I was thinking maybe there was something similar for Julia.</p>",
        "id": 224374382,
        "sender_full_name": "Davi Sales Barreira",
        "timestamp": 1611859977
    },
    {
        "content": "<p>These resources cost money, so you either pay for the product or you are the product <span aria-label=\"nerd\" class=\"emoji emoji-1f913\" role=\"img\" title=\"nerd\">:nerd:</span></p>",
        "id": 224375412,
        "sender_full_name": "Eric Forgy",
        "timestamp": 1611860381
    },
    {
        "content": "<p>Yeah, unfortunately brazilian currency is really depreciated compared to USD, so everything is waaaay too expensive for me :/</p>",
        "id": 224376012,
        "sender_full_name": "Davi Sales Barreira",
        "timestamp": 1611860606
    },
    {
        "content": "<p>Also, I deal with AWS a bit at my job... their pricing for simple low-resource machines for e.g. web hosting are pretty reasonable... but once you get into anything resembling serious computing, my <em>GOD</em> is their pricing insane.  You can build your very own machine with a GPU for ML for about 60 days worth of the same thing from AWS</p>",
        "id": 224376217,
        "sender_full_name": "Expanding Man",
        "timestamp": 1611860683
    },
    {
        "content": "<p>So I guess the lesson is that paying for hosting should be avoided like the plague for anything but very simple stuff</p>",
        "id": 224376252,
        "sender_full_name": "Expanding Man",
        "timestamp": 1611860705
    },
    {
        "content": "<p>And it's not even all AWS's fault (though I'm sure most of it is): pricing of \"commercial\" hardware is also totally insane.  Took me a while to even convince myself that the prices I was seeing on some dell servers were even real</p>",
        "id": 224376456,
        "sender_full_name": "Expanding Man",
        "timestamp": 1611860786
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"358317\">Davi Sales Barreira</span> <a href=\"#narrow/stream/274208-helpdesk-(published)/topic/Cloud.20computing.20with.20Julia/near/224376012\">said</a>:</p>\n<blockquote>\n<p>Yeah, unfortunately brazilian currency is really depreciated compared to USD, so everything is waaaay too expensive for me <span aria-label=\"confused\" class=\"emoji emoji-1f615\" role=\"img\" title=\"confused\">:confused:</span></p>\n</blockquote>\n<p>Could always buy like a raspberry Pi or something or an old desktop that's destined for the trash and turn it into your own personal cloud server.</p>",
        "id": 224377925,
        "sender_full_name": "Mason Protter",
        "timestamp": 1611861355
    },
    {
        "content": "<p>It might be worth reaching out to JC to see if you can work something out. They might be able to give you a break given the circumstances, e.g. maybe barter somehow.</p>",
        "id": 224378392,
        "sender_full_name": "Eric Forgy",
        "timestamp": 1611861528
    },
    {
        "content": "<p>There's a way to get Julia with GPUs working on colab</p>",
        "id": 224390347,
        "sender_full_name": "Ari Katz",
        "timestamp": 1611866799
    },
    {
        "content": "<p>I did this recently, following this guide: <a href=\"https://dev117uday.medium.com/how-to-run-julia-on-google-colab-dd631e6e7e43\">https://dev117uday.medium.com/how-to-run-julia-on-google-colab-dd631e6e7e43</a>. If the colab restarts, you'll unfortunately have to reinstall all your packages and wait for them to compile again. I ended up self-hosting something after using colab after a couple weeks, but it works (or at least did last time I tried in October-ish).</p>",
        "id": 224397735,
        "sender_full_name": "Robbie Rosati",
        "timestamp": 1611870836
    },
    {
        "content": "<p>If you look up the julia for pythonistas colab notebook, it runs.</p>",
        "id": 224416635,
        "sender_full_name": "Andrew Dinhobl",
        "timestamp": 1611880606
    }
]