[
    {
        "content": "<p>I am finding it awkward to write code that works with both dense and sparse arrays because the APIs differ in subtle ways. Two quick examples:</p>\n<ol>\n<li>Initializing zero arrays: you have to use <code>zeros</code> or <code>spzeros</code> instead of something like <code>zero(Vector{Int}, n)</code> and <code>zero(SparseVector{Int}, n)</code>.</li>\n<li>Iterating over non-zero elements: you have <code>findnz</code> for sparse arrays but not dense ones</li>\n</ol>\n<p>Do I just have put up with it and write the helper functions, or are there better options?</p>",
        "id": 223772897,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1611432696
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278517\">Evan Patterson</span> <a href=\"#narrow/stream/274208-helpdesk-(published)/topic/Consistent.20API.20for.20dense.20and.20sparse.20arrays/near/223772897\">said</a>:</p>\n<blockquote>\n<p>I am finding it awkward to write code that works with both dense and sparse arrays because the APIs differ in subtle ways.  Do I just have to ... write the helper functions, or are there better options?</p>\n</blockquote>\n<p>afaik Writing the smoothing, soothing, API unifying helpers that matter most and keeping them brief an in one place and not so many as to be hard to undo as the actual API s converge (one hopes and expects) while providing the specifics to JuliaArrays as separably approachable issues  would be the second best option.  Best would be a good clean solution through someone on discourse who has done it.</p>\n<p>Also the #arrays channel on Slack (I added you, you can remove you as you please) has people who know more than I about this.</p>",
        "id": 223776745,
        "sender_full_name": "Jeffrey Sarnoff",
        "timestamp": 1611436845
    },
    {
        "content": "<p>Thanks, I may also ask there. It's not too big a deal, but I bet I'm not the first or the last person to encounter this situation.</p>",
        "id": 223777686,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1611437283
    }
]