[
    {
        "content": "<p>When bumping the compat to the latest version of a dependency, the documentation build fails due to pkg not finding said latest version of the dependency in the registry. </p>\n<p>Both the CI build and local doc builds work just fine. Could the documentation build be using a different package server which hasn't synced yet? Its been four hours since the latest version of the dependency was registered.</p>\n<p><a href=\"https://github.com/DrChainsaw/NaiveGAflux.jl/runs/3394480837?check_suite_focus=true\">https://github.com/DrChainsaw/NaiveGAflux.jl/runs/3394480837?check_suite_focus=true</a></p>",
        "id": 250288881,
        "sender_full_name": "DrChainsaw",
        "timestamp": 1629659861
    },
    {
        "content": "<p>Your CI build makes sure to get the registry from github directly to circumvent the sporadically happening latencies in the pkg servers. I just learned, that there is also a julia-docdeploy action, maybe you could use that : <a href=\"https://github.com/julia-actions/julia-docdeploy\">https://github.com/julia-actions/julia-docdeploy</a></p>",
        "id": 250289650,
        "sender_full_name": "Felix Cremer",
        "timestamp": 1629660960
    },
    {
        "content": "<p>Thanks. I guess I'll sit tight a little bit more then and see if it works later. </p>\n<p>It isn't fully clear to me what the docdeploy action does. I already have a yml-file like the one and it makes docs build automatically for me. Does it also get the registry from github directly?</p>",
        "id": 250290631,
        "sender_full_name": "DrChainsaw",
        "timestamp": 1629662378
    },
    {
        "content": "<p>Probably the standard workaround is to use julia-buildpkg (before installing deps for docs) which has this hack: <a href=\"https://github.com/julia-actions/julia-buildpkg/blob/f995fa4149fed4a8e9b95ba82f54cc107c1d832a/action.yml#L17-L25\">https://github.com/julia-actions/julia-buildpkg/blob/f995fa4149fed4a8e9b95ba82f54cc107c1d832a/action.yml#L17-L25</a></p>\n<p>For example, you can see that the example in julia-docdeploy README uses julia-buildpkg.</p>",
        "id": 250290970,
        "sender_full_name": "Takafumi Arakaki (tkf)",
        "timestamp": 1629662771
    }
]