[
    {
        "content": "<p>When I search for \"dependent types Julia\", I see discussions where it is said that Julia does not have dependent types. Yet, I saw a recent presentation that said that Julia was dependently typed, and gave the example:</p>\n<div class=\"codehilite\" data-code-language=\"Julia\"><pre><span></span><code><span class=\"kt\">StatictVector</span><span class=\"p\">{</span><span class=\"kt\">Float64</span><span class=\"p\">,</span><span class=\"kt\">n</span><span class=\"p\">}</span>\n</code></pre></div>\n<p>Which indeed does seem like dependent types... So what is the correct answer here?</p>",
        "id": 424453981,
        "sender_full_name": "Davi Sales Barreira",
        "timestamp": 1709421792
    },
    {
        "content": "<p>Depends on the definition you’re using</p>",
        "id": 424454713,
        "sender_full_name": "Mason Protter",
        "timestamp": 1709422504
    },
    {
        "content": "<p>by most people’s definitions though, no Julia is not dependently typed</p>",
        "id": 424454749,
        "sender_full_name": "Mason Protter",
        "timestamp": 1709422527
    },
    {
        "content": "<p>But sometimes people say “dependantly typed” to mean “you can have values in type parameters”, in which case the answer is yes.</p>",
        "id": 424454999,
        "sender_full_name": "Mason Protter",
        "timestamp": 1709422585
    },
    {
        "content": "<p>I think the PL people in that unfortunate thread are mostly arguing that Julia isn't \"typed\" at all, by which they mean statically typed.</p>",
        "id": 424456067,
        "sender_full_name": "jar",
        "timestamp": 1709423587
    },
    {
        "content": "<p>I don't quite understand dependent typing, but I guess this idea of having values as parameters is what the person in the presentation was referring to.</p>",
        "id": 424457496,
        "sender_full_name": "Davi Sales Barreira",
        "timestamp": 1709424945
    },
    {
        "content": "<p>IMO the thing that's missing for Julia to have \"proper\" dependent typing is being able to say <code>StaticVector{Float64, 1 &lt;= n &lt;= 3}</code>  and have that mean something in subtyping. I.e., <code>StaticVector{Float64, 3}</code> would be a subtype of that, but <code>StaticVector{Float64, 15}</code> would not. It's not in general impossible to add that, but anyone who wants to do that must be able to answer questions like \"what if the constraint you want to put there can throw an error? Can it do IO? Is there an upper limit on computation time the query is allowed to take?\" because all of that runs in the compiler/type inference, and crashing/stalling the compiler is a big no-no (artificial testcases that don't indicate an underlying issue aside).</p>",
        "id": 424481823,
        "sender_full_name": "Sukera",
        "timestamp": 1709449500
    }
]