[
    {
        "content": "<p>I took a look at 1.8 (somewhat outdated, I presume), and there is a new feature in REPL: each time I paste strings, it adds additional indentation. So this ends up rather ugly.</p>\n<p><a href=\"/user_uploads/7178/VS8vc6AbWcGeS5elZXMSncHZ/flameshot-2021-08-06T17-21-12.png\">flameshot-2021-08-06T17-21-12.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/7178/VS8vc6AbWcGeS5elZXMSncHZ/flameshot-2021-08-06T17-21-12.png\" title=\"flameshot-2021-08-06T17-21-12.png\"><img src=\"/user_uploads/7178/VS8vc6AbWcGeS5elZXMSncHZ/flameshot-2021-08-06T17-21-12.png\"></a></div><p>Does anyone know, when and where exactly it was introduced?</p>",
        "id": 248617193,
        "sender_full_name": "Kwaku Oskin",
        "timestamp": 1628259761
    },
    {
        "content": "<p>Does that happen consistently? I've seen a similarly weird behaviour from time to time in stable versions, but it doesn't bother me too much because it's fairly rare</p>",
        "id": 248671381,
        "sender_full_name": "Mosè Giordano",
        "timestamp": 1628285734
    },
    {
        "content": "<p>It just happened and then disappeared again.<br>\nVery strange, I do not really know what is going.</p>",
        "id": 248674007,
        "sender_full_name": "Kwaku Oskin",
        "timestamp": 1628287491
    },
    {
        "content": "<p>This probably comes from the \"auto-indent\" feature of the REPL (set in <code>Base.active_repl.options.auto_indent</code>). When you press enter, the next line is indented like the current one. Then, when you paste some code, this should be disabled (the REPL normally recognizes that you are pasting, so auto-indent is temporarily disabled). But in some circumstances (I don't remember when, maybe with some Windows shell?), this is not recognized, so each new line of the pasted code, presumably already indented, gets more spaces added in front because of auto-indentation.</p>",
        "id": 248701194,
        "sender_full_name": "Rafael Fourquet",
        "timestamp": 1628319525
    },
    {
        "content": "<p>Yep, that's what I thought as well.</p>\n<p>It was not a windows shell, though, it was paste in neovim terminal.</p>\n<p>But at the moment when I have figured out how to turn auto indentation off, this effect disappeared. Pure magic :-)</p>",
        "id": 248702172,
        "sender_full_name": "Kwaku Oskin",
        "timestamp": 1628320939
    },
    {
        "content": "<p>Probably an issue with bracketed pasting; some terminals (notably Windows' cmd) don't support it, so you get auto indentation because it looks like someone is just typing code to the REPL.</p>",
        "id": 248704204,
        "sender_full_name": "Sebastian Pfitzner",
        "timestamp": 1628324158
    },
    {
        "content": "<p>It was neovim terminal, not windows.</p>\n<p>Now I know the cure, but I wonder, why it appear and disappear again \\_(%)_/</p>",
        "id": 248710730,
        "sender_full_name": "Kwaku Oskin",
        "timestamp": 1628334091
    }
]