[
    {
        "content": "<p>Hi all.</p>\n<p>I'm trying to simulate several models, all of which are different types of <a href=\"https://en.wikipedia.org/wiki/Graph_dynamical_system\">graph dynamical systems</a>. These are systems defined over discrete graphs and discrete state spaces, with a function <strong>per vertex</strong> describing the dynamics of that vertex with its incoming neighbors as input. Additionally, an <strong>update scheme defines the order to apply the functions</strong>, further defining the system's dynamics as a whole.</p>\n<p>I want to ensure I'm not missing some package that already covers such functionality.</p>\n<ul>\n<li>At first glance, <a href=\"https://juliadynamics.github.io/NetworkDynamics.jl/stable/\"><code>NetworkDynamics.jl</code></a> seemed like it might be a fit, but I think its coupling with <a href=\"https://github.com/SciML/DifferentialEquations.jl\"><code>DifferentialEquations.jl</code></a> rules it out for my use case—creating different functions per vertex is messy, and an update scheme isn't possible as long as diff eq are involved.</li>\n<li><a href=\"https://juliadynamics.github.io/Agents.jl/stable/\"><code>Agents.jl</code></a> with its <a href=\"https://juliadynamics.github.io/Agents.jl/stable/api/#Agents.GraphSpace\"><code>GraphSpace</code></a> seemed like another option. I could get the per-vertex functions and the customized schedule working, but it feels a little hacky.</li>\n<li>I could also use <code>DynamicalSystems.jl</code>'s <a href=\"https://juliadynamics.github.io/DynamicalSystems.jl/dev/tutorial/#DynamicalSystemsBase.ArbitrarySteppable\"><code>ArbitrarySteppable</code></a> as it only enforces the existence of some <code>step</code> function, but it doesn't provide any structure beyond that.</li>\n<li>Maybe the most promising option is <a href=\"https://algebraicjulia.github.io/AlgebraicDynamics.jl/stable/\"><code>AlgebraicDynamics.jl</code></a> using <code>DiscreteMachine</code>s and a directed composition pattern. I'm not familiar with category theory, so I'm not sure if this is even relevant to build on top of, but just judging from the abstraction I see in the documentation, it seems to match fairly well with the <a href=\"https://en.wikipedia.org/wiki/Graph_dynamical_system\">graph dynamical systems</a> formalization on Wikipedia.</li>\n</ul>\n<p>Are there any other packages I've missed—especially any that might be better suited for this task?</p>",
        "id": 462498611,
        "sender_full_name": "Reuben Gardos Reid",
        "timestamp": 1723708851
    }
]