[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217836\">@Kevin Bonham</span> interesting paper, that. I never heard about BURST before. Do you know of any papers that measure how much better BURST is than other (k-mer based) aligners in e.g. a metagenomic setting or at various levels of nucleotide identity?  The BURST paper itself skips _very_ lightly over the methodology.<br>\nI mean, if you have a 250 bp read with 80% nt identity, there would be only 6.7e-5 probability of a length 12 kmer not matching if the mismatches were randomly distributed. And in bacteria, my experience is that there are usually some more conserved areas around the interesting parts of the genome anyway.</p>",
        "id": 242979303,
        "sender_full_name": "Jakob Nybo Nissen",
        "timestamp": 1623912756
    },
    {
        "content": "<p>(That being said, for some applications, if I could get even 10% of the reads to align more accurately, I would happily pay 10x the compute for that)</p>",
        "id": 242979406,
        "sender_full_name": "Jakob Nybo Nissen",
        "timestamp": 1623912845
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"272650\">@Jakob Nybo Nissen</span> I have not seen anyone use it in the wild. At a conference they presented some really impressive benchmarks - the context was shallow shotgun gut metagenomes, and the claim was that BURST allowed them to get remarkably good taxonomic assignment with like 20% of the number of reads.</p>\n<p>Which would be huge, if true. But the last time I looked at the paper and the documentation, it was not obvious to me what steps to take to reproduce that.</p>",
        "id": 243002042,
        "sender_full_name": "Kevin Bonham",
        "timestamp": 1623928200
    },
    {
        "content": "<p>The reason I'm somewhat skeptical is that, if it was just a matter of more compute, people would have run Needleman-Wunch on reads already. I don't know how much effort and money it takes to obtain, say 200 gut metagenome NGS runs, but I'm betting it's a lot. Spending tens of thousands of dollars on that, and then not wanting to pay for a server to sit and run N-W for a few days would be weird.</p>",
        "id": 243002263,
        "sender_full_name": "Jakob Nybo Nissen",
        "timestamp": 1623928343
    },
    {
        "content": "<p>I know Dan Knights (the PI) has a company (or consults with one maybe) that does analysis of microbiome metagenomes in a commercial setting, and I think they're using BURST for that, but I'm not sure</p>",
        "id": 243002299,
        "sender_full_name": "Kevin Bonham",
        "timestamp": 1623928371
    },
    {
        "content": "<p>Well yeah, I mean that's what they were hyping - a revolution that gets you the precision of NW at drastically higher speeds. But it's tough to evaluate that claim of I can't run it <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 243002448,
        "sender_full_name": "Kevin Bonham",
        "timestamp": 1623928473
    }
]