[
    {
        "content": "<p>I've recently given DaemonMode a second look, and realised it's almost what I'd need it to be for use in my own workflows.</p>\n<p>One major stumbling block for me, is that it does not support running code in different projects/environments. I'd think this would be akin to how when you do <code>using &lt;module&gt;</code> the module itself is loaded using its own environment. What I'm hoping, is that there's a way I could instantiate different environments and then run the (DaemonMode-constructed) anonymous modules in their appropriate environment.</p>\n<p>E.g. something like this (in effect)</p>\n<div class=\"codehilite\" data-code-language=\"Julia\"><pre><span></span><code><span class=\"n\">env</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"n\">constructenvfromprojectpath</span><span class=\"p\">(</span><span class=\"s\">\"/path/to/project/folder\"</span><span class=\"p\">)</span>\n<span class=\"n\">m</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"n\">anon_module_within</span><span class=\"p\">(</span><span class=\"n\">env</span><span class=\"p\">)</span>\n<span class=\"n\">Core</span><span class=\"o\">.</span><span class=\"n\">eval</span><span class=\"p\">(</span><span class=\"n\">m</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"ss\">:stuff</span><span class=\"p\">)</span><span class=\"w\"> </span><span class=\"c\"># executed within the project ^</span>\n</code></pre></div>\n<p>Is this possible? The docs don't seem to be particularly informative when it comes to this sort of usage.</p>\n<p>Ideally, I'd also like to be able to load different versions of the same package within different project environments.</p>",
        "id": 339538426,
        "sender_full_name": "Timothy",
        "timestamp": 1677930378
    },
    {
        "content": "<p>The answer I seem to be arriving at is \"you can't\"</p>",
        "id": 339798964,
        "sender_full_name": "Timothy",
        "timestamp": 1678090072
    },
    {
        "content": "<p>Yes, you can't.  In fact, there's basically no way to do this at all within a given julia process (DaemonMode or not): once you've loaded a library once, you can't load a different version of it.  Because the package is identified by its UUID internally when it's loaded, and that UUID is fixed across versions.</p>\n<p>(In principle, you could maybe subvert this mechanism in a very dirty way by fooling the system with a new set of UUIDs for each new environment.  Which would mean writing a pile of environment management code yourself.)</p>",
        "id": 339805890,
        "sender_full_name": "c42f",
        "timestamp": 1678092179
    },
    {
        "content": "<p>Mmm, since Saturday I've started up a new project that could end up being what I hoped DaemonMode was, with workers started up per environment. I'm currently got a few pieces of it working.</p>",
        "id": 339806682,
        "sender_full_name": "Timothy",
        "timestamp": 1678092387
    }
]