[
    {
        "content": "<p>Do you know if I can run the .github actions of a repo locally  before pushing on the remote  ? <br>\nThere are some several discussions online, but how are you people doing it ?<br>\nAt the very least I would expect that .github actions would be triggered in the forked repo, but apparently some configurations are needed there as well, which they are not clear to me right now. <br>\nIf you have experience with that, how are  your setup/configurations ?</p>",
        "id": 367556064,
        "sender_full_name": "Filippos Christou",
        "timestamp": 1687164410
    },
    {
        "content": "<p>You can try <a href=\"https://github.com/nektos/act\">https://github.com/nektos/act</a> to run them locally.</p>\n<p>If you go to the actions tab in a forked repo, you should see an option to enable them if they aren't. The required config varies depending on the workflow. E.g. some may require secrets or URLs to be changed to your dev env. For basic things like running tests, you may have to change the trigger if it only runs on <code>pull_request</code> but you want to run it on <code>push</code>es as well on your fork (keeping in mind they run tests on different commits) so that you don't have to open a PR on your fork first</p>",
        "id": 367559212,
        "sender_full_name": "Sascha Mann",
        "timestamp": 1687165087
    },
    {
        "content": "<p>That said, I generally don't run them locally. I might run the same tests that are run by the actions manually but I don't try to run the exact workflow.</p>",
        "id": 367559647,
        "sender_full_name": "Sascha Mann",
        "timestamp": 1687165177
    },
    {
        "content": "<blockquote>\n<p>you may have to change the trigger</p>\n</blockquote>\n<p>I think that was what I was missing. That's a bit inconvenient because then I will have to rechange it before doing the PR. Making a PR to the forked master doesn't sound so bad actually and it should be enough to replicate the actions..</p>",
        "id": 367563349,
        "sender_full_name": "Filippos Christou",
        "timestamp": 1687165942
    }
]